[{
	"name": "monument",
	"cover": "monument.png",
	"animate": false,
	"context": "Before you stands an odd monument-like megastructure approximately 40 meters in height, and 5x5 meters in width and length. It's shaped like a thin pyramid, with various degraded inscriptions along each of its corners, and appears to be a religious monument of some sort due to its complex ornamentation.",

	"conflicts": [{
		"name": "K0",
		"def": "You notice a small, rough potrusion on the side of the otherwise unnaturally smooth surface of the monument. Small specs of dust fall out of its cracks, hinting at its recent apparition.",
		"choices": [{
			"def": "Push the extruded wall.",
			"con": {
				"def": "The monument trembles in front of you. Pieces from its top plummet to the ground.",
				"choices": [{
					"name": "R0",
					"def": "Run.",
					"res": "The structure collapses, you escape without getting hurt."
				}, {
					"name": "R1",
					"def": "Try to dodge the debris, stay near the monument.",
					"res": "A piece of the monument falls on you, your ankle is badly injured, but you are otherwise fine. The monument is destroyed."
				}]
			}
		}, {
			"def": "Pull the extrusion.",
			"con": {
				"def": "The extrusion slides further out and revelas a semi-decomposed alien corpse. Its fingers are curled around some sort of scroll.",
				"choices": [{
					"name": "R0",
					"def": "Grab the scroll.",
					"res": "You grab the scroll from the creature's hands. It revelas a mythical telling of an epic battle that occured near this site. Most of the writing has unfortunately washed away, but you can make out a few key words that describe the incident as a major event that would bring peace for thousands of years."
				}, {
					"name": "R1",
					"def": "Push the coffin back into the monument.",
					"res": "The coffin fits back into the monument. A silent, low-pitched hum spreads through the air. Everything is calm."
				}]
			}
		}]
	}, {
		"name": "K1",
		"def": "Lines driving up the monument's smooth walls light up a cyan blue and illuminate the dust floating in the atmosphere. The lights lead to an open door on the side of the megastructure.",
		"choices": [{
			"name": "R0",
			"def": "Enter the passageway.",
			"res": "The door closes right as you attempt to enter it, clipping one of your fingers and breaking a part of it."
		}, {
			"name": "R1",
			"def": "Wait to see if anything comes out the door.",
			"res": "The door slowly closes, the lights of the structure dim."
		}],
		"conditions": [{
			"entity": "monument",
			"con": "K0",
			"res": "R1"
		}]
	}]
}, {
	"name": "unit70f",
	"cover": "unit70f.png",
	"animate": true,
	"context": "Unit 70F_: CjUisj3kg2-.",

	"conflicts": [{
		"name": "K0",
		"def": "AKZYX9gGwN.",
		"choices": [{
			"def": "fBjWBWTxBk.",
			"con": {
				"def": "DisjBLJEFX.",
				"choices": [{
					"name": "R0",
					"def": "1CyiS8K14U.",
					"res": "9eqg5gV8eV."
				}, {
					"name": "R1",
					"def": "fJAPLbLAYG.",
					"res": "UpzLzYM9zl."
				}, {
					"name": "R2",
					"def": "aoKIcRwGl7.",
					"res": "3gif450Asb."
				}, {
					"name": "R3",
					"def": "D1dCcq1w4a.",
					"res": "D7RU2nUY0G."
				}]
			}
		}, {
			"def": "iwCsFgz44S.",
			"con": {
				"def": "J3oYBT50yc.",
				"choices": [{
					"name": "R0",
					"def": "AiPyvMdReb.",
					"res": "XCbxKNfpeh."
				}, {
					"name": "R1",
					"def": "vgo8IuO82W.",
					"res": "VKUQFf4krG."
				}, {
					"name": "R2",
					"def": "JiAZ8Ec5Dr.",
					"res": "WutHSUG3Vp."
				}, {
					"name": "R3",
					"def": "zRPgehlMSx.",
					"res": "68o8SG0IKb."
				}]
			}
		}]
	}, {
		"name": "K1",
		"def": "rx0TTWHBg8.",
		"choices": [{
			"name": "R0",
			"def": "eG4ea1CNT3.",
			"res": "JQ5fVZCXgI."
		}, {
			"name": "R1",
			"def": "RVPRgdQmsC.",
			"res": "eR1zg2VKik."
		}]
	}]
}]